x = input('Введите обозначение ноты: ')
z = x[0]
n = int(x[1])
c = 16.35
d = 18.35
e = 20.60
f = 21.83
g = 24.50
a = 27.50
h = 30.87
if z == 'c':
    c1 = c*(2**n)
    print('Частота в Гц: ', c1)
elif z == 'd':
    d1 = d*(2**n)
    print('Частота в Гц: ', d1)
elif z == 'e':
    e1 = e*(2**n)
    print('Частота в Гц: ', e1)
elif z == 'f':
    f1 = f*(2**n)
    print('Частота в Гц: ', f1)
elif z == 'g':
    g1 = g*(2**n)
    print('Частота в Гц: ', g1)
elif z == 'a':
    a1 = a*(2**n)
    print('Частота в Гц: ', a1)
elif z == 'h':
    h1 = h*(2**n)
    print('Частота в Гц: ', h1)
